## SQL Project
SQL is a standard language used to store extracy and manipulate data in a database. In this project we learn about the different functions and commands that allow the manipulation of data to take place. We also learn how to create tables using the SQL command found on the localhost.

In [2]:
import pandas as pd
import psycopg2
import sqlalchemy
from sqlalchemy.engine import create_engine
import config

In [3]:
conn = psycopg2.connect(host="localhost", database="umuzi", user="user", password="pass")
cur = conn.cursor()

In [4]:
def create_pandas_table(sql_query, database = conn):
    table = pd.read_sql_query(sql_query, database)
    return table

# Part 1: Creating a database

Save all of your instructions in a script file - you will submit this file on Gnomio and github.

Create a database called “Umuzi”.

Create the following tables in the Umuzi database:
Customers
Employees
Orders
Payments
Products

In [5]:
Customers = create_pandas_table("SELECT * FROM Customers")
Customers

,customerid,firstname,lastname,gender,address,phone,email,City,Country
0,1,John,Hibert,Male,284 chaucer st,84789657,john@gmail.com,Johannesburg,South Africa
1,2,Thando,Sithole,Female,Clerk,794445584,thando@gmail.com,Cape Town,South Africa
2,3,Leon,Glen,Male,"81 Evarton Rd,Gillits",820822830,leon@gmail.com,Durban,South Africa
3,4,Charl,Muller,Male,290A Dorset Ecke,44856872553,Charl.muller@yahoo.com,Berlin,Germany
4,5,Julia,Stein,Female,2 Wernerring,448672445058,Js234@yahoo.com,Frankfurt,Germany

In [6]:
Employees = create_pandas_table("SELECT * FROM Employees")
Employees

   employeeid firstname lastname           email    jobtitle
0           1      Kani  Matthew   mat@gmail.com     Manager
1           2     Lesly   Cronje  LesC@gmail.com       Clerk
2           3    Gideon   Maduku     m@gmail.com  Accountant

In [7]:
Orders = create_pandas_table("SELECT * FROM Orders")
Orders

,orderid,productid,paymentid,fulfilledbyemployeeid,daterequired,dateshipped,status
0,1,1,1,2,2018-09-05,NaT,Not shipped
1,2,1,2,2,2018-04-09,2018-03-09,Shipped
2,3,3,3,3,2018-09-06,NaT,Not shipped

In [8]:
Payments = create_pandas_table("SELECT * FROM Payments")
Payments

   customerid  paymentid paymentdate  amount
0           1          1  2018-01-09  150.75
1           5          2  2018-03-09  150.75
2           4          3  2018-03-09  700.60

In [9]:
Products = create_pandas_table("SELECT * FROM Products")
Products

,productid,productname,description,buyprice
0,1,Harley Davidson Chopper,"This replica features working kickstand, front...",150.75
1,2,Classic Car,"Turnable front wheels, steering function",550.75
2,3,Sports car,"Turnable front wheels, steering function",700.60

# The following are the commands as they were inputed on the SQL command for the creation and population of the table.

In [10]:
# CREATE TABLE Customers(

#     CustomerID SERIAL PRIMARY KEY,
#     FirstName varchar(50),
#     LastName varchar(50),
#     Gender varchar,
#     Address varchar(200),
#     Phone bigint,
#     Email varchar(100),
#     City varchar(20),
#     Country varchar(50)
# );

# INSERT INTO Customers VALUES(1,'John', 'Hibert', 'Male', '284 chaucer st', '084789657','john@gmail.com', 'Johannesburg', 'South Africa');
# INSERT INTO Customers VALUES(2,'Thando', 'Sithole', 'Female', '240 Sect 1', '0794445584', 'thando@gmail.com', 'Cape Town', 'South Africa');
# INSERT INTO Customers VALUES(3,'Leon', 'Glen', 'Male', '81 Everton Rd,Gillits', '0820832830', 'Leon@gmail.com', 'Durban', 'South Africa');
# INSERT INTO Customers VALUES(4,'Charl', 'Muller', 'Male', '290A Dorset Ecke', '+44856872553', 'Charl.muller@yahoo.com', 'Berlin', 'Germany');
# INSERT INTO Customers VALUES(5,'Julia', 'Stein', 'Female', '2 Wernerring', '+448672445058', 'Js234@yahoo.com', 'Frankfurt', 'Germany')



# CREATE TABLE Emloyees(
#     EmployeeID SERIAL PRIMARY KEY,
#     FirstName varchar(50),
#     LastName varchar(50),
#     Address varchar(200),
#     Email varchar(100),
#     JobTitle varchar(20)
# );

# INSERT INTO Employees VALUES(1,'Kani', 'Matthew', 'mat@gmail.com', 'Manager');
# INSERT INTO Employees VALUES(2,'Lesly', 'Cronje', 'LesC@gmail.com', 'Clerk');
# INSERT INTO Employees VALUES(3,'Gideon', 'Maduku', 'm@gmail.com', 'Accountant')

# CREATE TABLE Orders(
#     OrderId SERIAL PRIMARY KEY,
#     ProductID int,
#     PaymentID int,
#     FulfilledByEmployeeID int,
#     DateRequired timestamp,
#     DateShipped timestamp,
#     Status varchar(20),
# );

# INSERT INTO Orders VALUES(1, 1, 1, 2, '05-09-2018', 'Nul', 'Not shipped');
# INSERT INTO Orders VALUES(2, 1, 2, 2, '04-09-2018', '03-09-2018', 'Shipped');
# INSERT INTO Orders VALUES(3, 3, 3, 3, '06-09-2018','Nul', 'Not shipped')

# CREATE TABLE Payments(
#     CustomerId SERIAL PRIMARY KEY,
#     PaymentID int,
#     PaymentDate timestamp,
#     Amount decimal,
#     FOREIGN KEY(PaymentID) REFERENCES Orders(OrderId)
# );

# INSERT INTO Payments VALUES(1, 1, '01-09-2018', 150.75);
# INSERT INTO Payments VALUES(5, 2, '03-09-2018', 150.75);
# INSERT INTO Payments VALUES(4, 3, '03-09-2018', 700.60)

# CREATE TABLE Products(
#     ProductID SERIAL PRIMARY KEY,
#     ProductName varchar(100),
#     Description varchar(300),
#     BuyPrice decimal,
#     FOREIGN KEY(ProductID) REFERENCES Orders(OrderId)
# );

# INSERT INTO Products VALUES(1, 'Harley Davidson Chopper', 'This replica features working kickstand, front suspension, gear-shift lever', 150.75);
# INSERT INTO Products VALUES(2, 'Classic Car', 'Turnable front wheels, steering function', 550.75);
# INSERT INTO Products VALUES(3, 'Sports car', 'Turnable front wheels, steering function', 700.60)

# PART 2
The following queries are in relation to the above tables created. This is to see if we can extract specific data from the tables using SQL commancds and functions.

In [19]:
#1.SELECT ALL records from table Customers.
import sys
import sqlite3

In [20]:
%sql SELECT * FROM Customers

UsageError: Line magic function `%sql` not found.

In [21]:
#2. SELECT records only from the name column in the Customers table.
SELECT FirstName, LastName
FROM Customers;

SyntaxError: invalid syntax (<ipython-input-21-ca2211544309>, line 2)

In [22]:
#3. Show the name of the Customer whose CustomerID is 1.
SELECT FirstName, LastName
FROM Customers
WHERE CustomerID = 1;

SyntaxError: invalid syntax (<ipython-input-22-9f85c021b889>, line 2)

In [23]:
#4. UPDATE the record for CustomerID = 1 on the Customer table so that the name is “Lerato Mabitso”.
UPDATE Customers
SET FirstName = 'Lerato', LastName = 'Mabitso'
Where CustomerId = 1;

SyntaxError: invalid syntax (<ipython-input-23-77dcb9b3f302>, line 2)

In [24]:
#5. DELETE the record from the Customers table for customer 2 (CustomerID = 2).
DELETE FROM Customers
WHERE CustomerID =2;

SyntaxError: invalid syntax (<ipython-input-24-58b0a59239b4>, line 2)

In [25]:
#6. Select all unique statuses from the Orders table and get a count of the number of orders for each unique status.
Select DISTINCT Status
FROM Orders and COUNT Status;

SyntaxError: invalid syntax (<ipython-input-25-365578a0ea9e>, line 2)

In [26]:
#7. Return the MAXIMUM payment made on the PAYMENTS table.
SELECT MAX(Amount)
FROM Payments;

SyntaxError: invalid syntax (<ipython-input-26-66f0266c970b>, line 2)

In [27]:
#8. Select all customers from the “Customers” table, sorted by the “Country” column.
SELECT CustomerID
FROM Customers
ORDER BY Country;

SyntaxError: invalid syntax (<ipython-input-27-2ec03d7c5f3d>, line 2)

In [28]:
#9. Select all products with a price BETWEEN R100 and R600.
SELECT BuyPrice
FROM Products
Where BuyPrice BETWEEN 100 and 600;

SyntaxError: invalid syntax (<ipython-input-28-c16f2d805143>, line 2)

In [29]:
#10. Select all fields from “Customers” where country is “Germany” AND city is “Berlin”.
SELECT City, Country FROM Customers
WHERE Country = 'Germany' AND City = 'Berlin';

SyntaxError: invalid syntax (<ipython-input-29-b29171af6570>, line 2)

In [30]:
#11. Select all fields from “Customers” where city is “Cape Town” OR “Durban”.
SELECT City, Country FROM Customer
WHERE City = 'Cape Town' OR City = 'Durban';

SyntaxError: invalid syntax (<ipython-input-30-8c7cd3d9589b>, line 2)

In [31]:
#12. Select all records from Products where the Price is GREATER than R500.
SELECT BuyPrice FROM Products
WHERE BuyPrice > 500;

SyntaxError: invalid syntax (<ipython-input-31-7bb55314d25b>, line 2)

In [32]:
#13. Return the sum of the Amounts on the Payments table.
SELECT SUM(Amounts)
FROM Payments;

SyntaxError: invalid syntax (<ipython-input-32-26b057c88a49>, line 2)

In [33]:
#14. Count the number of shipped orders in the Orders table.
SELECT COUNT(DateShipped)
FROM Orders;

SyntaxError: invalid syntax (<ipython-input-33-66a047e1646f>, line 2)

In [34]:
#15. Return the average price of all Products, in Rands and in Dollars (assume the exchange rate is R12 to the Dollar).
SELECT AVG(BuyPrice) AS 'Rands', AVG(BuyPrice/12) AS 'Dollars';

SyntaxError: invalid syntax (<ipython-input-34-39bfea4eea4b>, line 2)

In [35]:
#16. Using INNER JOIN create a query that selects all Payments with Customer information.
SELECT Customers FROM Payments
INNER JOIN Customers
ON Payments  = Customers;

SyntaxError: invalid syntax (<ipython-input-35-347c8023d33a>, line 2)

In [36]:
#17. Select all products that have turnable front wheels.
SELECT Description
FROM Products
WHERE Description = 'Turnable front wheels',

SyntaxError: invalid syntax (<ipython-input-36-6718c3a57561>, line 2)